In [1]:
import pandas as pd
import numpy as np
path = 'https://github.com/dongupak/DataML/raw/main/csv/vehicle_prod.csv'
df = pd.read_csv(path)
df

  Unnamed: 0   2007   2008   2009   2010   2011
0      China   7.71   7.95  11.96  15.84  16.33
1         EU  19.02  17.71  15.00  16.70  17.48
2         US  10.47   8.45   5.58   7.60   8.40
3      Japan  10.87  10.83   7.55   9.09   7.88
4      Korea   4.04   3.78   3.45   4.20   4.62
5     Mexico   2.01   2.05   1.50   2.25   2.54

In [3]:
df.to_csv("vehicle_prod.csv")

In [5]:
df = pd.read_csv(path, index_col = 0)
df

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [6]:
print(df.index)

Index(['China', 'EU', 'US', 'Japan', 'Korea', 'Mexico'], dtype='object')

In [7]:
df['2007']

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [8]:
list_a:list = df.columns.tolist()
print(list_a)

['2007', '2008', '2009', '2010', '2011']

In [9]:
list_b:list = df['2007'].to_list
print(list_b)

<bound method IndexOpsMixin.tolist of China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64>

In [11]:
df['total'] = df.sum(axis=1)
df

         2007   2008   2009   2010   2011   total
China    7.71   7.95  11.96  15.84  16.33  119.58
EU      19.02  17.71  15.00  16.70  17.48  171.82
US      10.47   8.45   5.58   7.60   8.40   81.00
Japan   10.87  10.83   7.55   9.09   7.88   92.44
Korea    4.04   3.78   3.45   4.20   4.62   40.18
Mexico   2.01   2.05   1.50   2.25   2.54   20.70

In [14]:

df.columns
data= [[10, 20, 30, 40], [50, 60, 70, 80]]
properties = ['A', 'B', 'C', 'D']
new_df = pd.DataFrame(data, columns= properties)
new_df

    A   B   C   D
0  10  20  30  40
1  50  60  70  80

In [15]:
new_df = new_df.drop('B', axis=1, inplace=False)
new_df

    A   C   D
0  10  30  40
1  50  70  80

In [17]:
df.iloc[:, 1:4]

         2008   2009   2010
China    7.95  11.96  15.84
EU      17.71  15.00  16.70
US       8.45   5.58   7.60
Japan   10.83   7.55   9.09
Korea    3.78   3.45   4.20
Mexico   2.05   1.50   2.25

In [ ]:
path = 'https://github.com/dongupak/DataML/raw/main/csv/weather.'
weather = pd.read_csv(path, encoding='CP949')
weather.tail()